{
    "0": "الحرم المكي (The Holy Mosque in Mecca) - The holiest mosque in Islam and the primary destination for the Hajj and Umrah pilgrimages. It surrounds the Kaaba, considered the most sacred site in Islam.",
    "1": "العلا (AlUla) - A historic city in northwestern Saudi Arabia, known for its stunning natural rock formations, archaeological sites including Hegra (Saudi Arabia's first UNESCO World Heritage site), and annual Winter at Tantora festival.",
    "2": "المسجد النبوي (The Prophet's Mosque) - Located in Medina, this is the second holiest site in Islam. It was built by Prophet Muhammad and houses his tomb.",
    "3": "جبل أحد (Mount Uhud) - A mountain north of Medina, famous for being the site of the Battle of Uhud fought in 625 CE. It has great historical and religious significance in Islamic history.",
    "4": "برج المملكة (Kingdom Tower) - Also known as Kingdom Centre, it's a 99-story skyscraper in Riyadh. With its distinctive inverted parabolic arch topped by a sky bridge, it's one of Saudi Arabia's most recognizable landmarks.",
    "5": "المصمك (Masmak Fort) - A clay and mud-brick fort in the old quarter of Riyadh, with distinctive features including high walls and watchtowers. It played a significant role in the history of Saudi Arabia's unification.",
    "6": "برج الفيصلية (Al Faisaliyah Tower) - One of the most distinctive skyscrapers in Riyadh, featuring a golden ball near its top that contains a restaurant with panoramic views of the city.",
    "7": "وادي حنيفة (Wadi Hanifa) - A valley that runs through the city of Riyadh. It has been transformed into an environmental, recreational and tourist destination with parks, walking paths, and water features.",
    "8": "فقيه أكواريوم (Fakieh Aquarium) - Located in Jeddah, it's the first and largest public aquarium in Saudi Arabia, housing a wide variety of marine life and offering educational exhibits.",
    "9": "كورنيش جدة (Jeddah Corniche) - A 30 km coastal resort area in Jeddah along the Red Sea. It features recreational areas, pavilions, large-scale sculptures, and the King Fahd Fountain, the tallest water fountain in the world.",
    "10": "برج مياه الخبر (Khobar Water Tower) - A distinctive landmark in the city of Khobar in the Eastern Province, known for its unique architectural design.",
    "11": "مسجد قباء (Quba Mosque) - Located in the outskirts of Medina, it's the oldest mosque in the world. According to Islamic tradition, it was founded by Prophet Muhammad when he arrived in Medina.",
    "12": "مسجد الراجحي (Al-Rajhi Mosque) - One of the largest mosques in Riyadh, known for its beautiful architecture combining traditional Islamic elements with modern design.",
    "13": "المتحف الوطني (The National Museum) - Located in Riyadh, it's the largest museum in Saudi Arabia showcasing the history, culture, and civilization of the Arabian Peninsula."
}